DataProcessors/ПриемкаКоллективная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПриемкаКоллективная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемкиГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаОтВнешнегоПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСостояниеКодаВЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСоответствиеКодаТоваруПоGTIN</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПриниматьКМБезПроверкиСостояния</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверятьКодыСОжидаемымиПриПриемке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПриемкаКоллективная/Forms/ФормаСпискаПТУ/Ext/Form/Module.bsl
&НаКлиенте
Перем РежимРаботыПрилоежния;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗагрузитьДокументыПТУ();
	РежимРаботыПрилоежния = ОбщегоНазначения.ПолучитьРежимРаботыПриложения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДокументыПТУ(Команда)
	
	//+Белов А. 08.06.2026 #UT10-5895
	Элементы.ПроверкаВЧЗ.Пометка = Ложь;
	
	УстановитьОформлениеКнопок();
	//-Белов А. 08.06.2026 #UT10-5895
	
	ЭтаФорма.ЗначениеДляПоиска = "";
	ЗагрузитьДокументыПТУ();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДокументыПТУ()
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокДокументовПТУ();	
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
		
	КонецЕсли; 
		
	Если РезультатСтруктура.Результат Тогда
		
		СписокПТУ.Параметры.УстановитьЗначениеПараметра("ИспользоватьПоиск", Ложь);
		СписокПТУ.Параметры.УстановитьЗначениеПараметра("НомерДокумента", "");
		
		Оповестить("ОбновлениеДанных");
		
	КонецЕсли;                                      
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМаркировкиПоДокументуПТУ(ДокументГУИД)
	
	РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокМаркировок(ДокументГУИД);	
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
		Возврат;
		
	КонецЕсли; 
		
	Если РезультатСтруктура.Результат Тогда
		
		//СписокПТУ.Параметры.УстановитьЗначениеПараметра("ИспользоватьПоиск", Ложь);
		//СписокПТУ.Параметры.УстановитьЗначениеПараметра("НомерДокумента", "");
		//
		//Оповестить("ОбновлениеДанных");
		
	КонецЕсли;                                      
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновлениеДанных" Тогда
		Элементы.СписокПТУ.Обновить();
	ИначеЕсли ИмяСобытия = "СообщениеСозданДокументРазмещенияПоЯчейкам" Тогда
		ПоказатьПредупреждение(, Параметр.ТекстСообщения, 4);  
	ИначеЕсли ИмяСобытия = "МаркировкиЗаписаныВПТУ" Тогда       
		ПоказатьПредупреждение(, Параметр.ТекстСообщения, );
		//+Сёмин Р. 24.12.2025 #UT10-5593
	ИначеЕсли ИмяСобытия = "НайденоПТУПоТЕ" Тогда
		//КлючСтрокиПТУ = Новый КлючСтрокиДинамическогоСписка("Ссылка", Параметр);
		//Элементы.СписокПТУ.ТекущаяСтрока = КлючСтрокиПТУ;
		//не работает из-за низкой версии платформы на ТСД
		
		ТекСтр = Неопределено;
		Счетчик = 1;
		
		Пока Истина Цикл
			
			Данные = Элементы.СписокПТУ.ДанныеСтроки(Счетчик);
			
			Если Данные = Неопределено Тогда
				Прервать;
			КонецЕсли;
			
			Если Данные.Ссылка = Параметр.СсылкаПТУ Тогда
				
				ТекСтр = Счетчик;
				Прервать;
				
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
			
		КонецЦикла;
		
		Если ТекСтр <> Неопределено Тогда
			Элементы.СписокПТУ.ТекущаяСтрока = ТекСтр;
			СписокПТУВыбор(Неопределено, ТекСтр, Неопределено, Истина);
		Иначе
			Сообщить("Не удалось найти в списке и открыть ПТУ №" + Параметр.НомерСкладскогоДокумента);
		КонецЕсли;
		//-Сёмин Р. 24.12.2025 #UT10-5593
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	Элементы.СписокПТУ.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокПТУВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//+Белов А. 08.06.2026 #UT10-5895
	Если Элементы.ПроверкаВЧЗ.Пометка Тогда
		
		СтандартнаяОбработка = Ложь;
		Возврат;
		
	КонецЕсли;
	//-Белов А. 08.06.2026 #UT10-5895
	
	ТекДанные = Элементы.СписокПТУ.ДанныеСтроки(ВыбраннаяСтрока);
	НомерДокумента = ТекДанные.НомерСкладскогоДокумента;
	ДокументГУИД   = ТекДанные.Ссылка;
	
	ПараметрыРаботы	= ОбщегоНазначенияКлиент.СформироватьПараметрыДляФормы("ПриемкаКоллективная", Объект);
	ПараметрыРаботы.Вставить("НомерСкладскогоДокумента", НомерДокумента);
	ПараметрыРаботы.Вставить("ДокументГУИД", ТекДанные.Ссылка);   
	//+Шульман А. 13.11.2025 #UT10-5504   
	ПараметрыРаботы.Вставить("ПоставкаОтВнешнегоПоставщика", Истина); //ТекДанные.ПоставкаОтВнешнегоПоставщика);    
	//-Шульман А. 13.11.2025 #UT10-5504
	ОбщегоНазначения.ЗаписатьПараметрыРаботы("ПараметрыРаботыСДокументомПТУ", ПараметрыРаботы );			
	
	//+Кабанов А.В. 29.08.2025 # UT10-5361
	ДокументТребуетсяМаркировка = ТекДанные.ДокументТребуетсяМаркировка;

	Если ДокументТребуетсяМаркировка Тогда
		
		ОбщегоНазначения.ПолучитьСписокМаркировокПоПТУ(ДокументГУИД);
		
		ЕстьСтрокиВБуфереМаркировок = ТекДанные.ЕстьСтрокиВБуфереМаркировок;

		Если ЕстьСтрокиВБуфереМаркировок Тогда
			
			ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаписатьМаркировкиВПТУ", ЭтаФорма);
			
			ПараметрыСтр = Новый Структура;
			ПараметрыСтр.Вставить("ДокументГУИД", ДокументГУИД); 
			ПараметрыСтр.Вставить("НомерДокумента", НомерДокумента); 		
			НомерДокументаОоформление = ТекДанные.НомерДокументаОформление;
			ПараметрыСтр.Вставить("НомерДокументаОоформление", НомерДокументаОоформление); 		
			
			ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаНеРазмещенныхМаркировок", ПараметрыСтр, ЭтаФорма,,,, ОповещениеОЗакрытии);
			
			Возврат;
			
		КонецЕсли;
			
		КоличествоТоваровСМаркировкой       = ТекДанные.КоличествоТоваровСМаркировкой;
		КоличествоОтсканированныхМаркировок = ТекДанные.КоличествоОтсканированныхМаркировок;
		
		Если НЕ КоличествоТоваровСМаркировкой = КоличествоОтсканированныхМаркировок Тогда
			
			СписокОтветов = Новый СписокЗначений;
			СписокОтветов.Добавить(КодВозвратаДиалога.Да  , "Отсканировать сейчас");
			СписокОтветов.Добавить(КодВозвратаДиалога.Нет , "Отложить сканирование");
			
			ОтветНаВопрос = Вопрос("" , СписокОтветов , , КодВозвратаДиалога.Да , "Документ содержит маркируемые товары");  
			
			Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда 
				
				Закрыть();
				ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаСканированияМаркировок");
				
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;	
	//+Кабанов А.В. 29.08.2025 # UT10-5361
	
	ТекДанные = Элементы.СписокПТУ.ДанныеСтроки(ВыбраннаяСтрока);
	
	ЕстьСтрокиВБуфереКладовщика =  ТекДанные.ЕстьСтрокиВБуфереКладовщика;
	
	Если ЕстьСтрокиВБуфереКладовщика И РежимРаботыПрилоежния = "Production" Тогда
		
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("СоздатьДокументРазмещения", ЭтаФорма);		
		
		ПараметрыСтр = Новый Структура;
		ПараметрыСтр.Вставить("ДокументГУИД", ДокументГУИД); 
		ПараметрыСтр.Вставить("НомерДокумента", НомерДокумента); 		
		НомерДокументаОоформление = ТекДанные.НомерДокументаОформление;
		ПараметрыСтр.Вставить("НомерДокументаОоформление", НомерДокументаОоформление); 		
		
		Если ТекДанные.ТипПриемки = "Приемка ГМ" Тогда
			ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаНеРазмещенныхГМ", ПараметрыСтр, ЭтаФорма,,,,ОповещениеОЗакрытии );
		Иначе
			ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаНеРазмещенныхТоваров", ПараметрыСтр, ЭтаФорма,,,,ОповещениеОЗакрытии );
		КонецЕсли;
	
	Иначе
		
		Закрыть();	   
		
		Если ТекДанные.ТипПриемки = "Приемка ГМ" Тогда
			ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаРазмещениеГМ");
		Иначе
			ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаРазмещениеТовара");
		КонецЕсли;
		
	КонецЕсли; 
			
КонецПроцедуры                          

&НаКлиенте
Процедура СоздатьДокументРазмещения(Результат, ДополнительныеПараметры) Экспорт 
		
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	    
	
	ГМ = Ложь;
	
	Если Результат.Свойство("ГМ") Тогда
		ГМ = Результат.ГМ;	
	КонецЕсли;
	
	РезультатСтруктура = ОбщегоНазначения.СоздатьДокуметРазмещенияПоЯчейкам(Результат.ДокументГУИД, ГМ);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		Если НЕ РезультатСтруктура.Ошибка = "Отсутствуют отсканированные строки документа" Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		КонецЕсли;

		Возврат;
		
	КонецЕсли; 
	
	ТекстСообщения = "Создан документ размещения по ячейкам № %1 %2. Документ проведен";
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			РезультатСтруктура.Данные.НомерДокумента,
			РезультатСтруктура.Данные.ДатаДокумента 
			);						
			
	Оповещение = Новый ОписаниеОповещения("ОбновитьСписокПТУ", ЭтотОбъект);
	ПоказатьПредупреждение(Оповещение, ТекстСообщения, 4);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьМаркировкиВПТУ(Результат, ДополнительныеПараметры) Экспорт 
	//+Кабанов А.В. 29.08.2025 # UT10-5361	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	    
	
	РезультатСтруктура = ОбщегоНазначения.ЗаписатьМаркировкиВДокументПТУ(Результат.ДокументГУИД);
	
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		
		Если НЕ РезультатСтруктура.Ошибка = "Отсутствуют отсканированные маркировки" Тогда
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли; 
	
	ТекстСообщения = "Маркировки записаны в документ ПТУ № %1 %2. Документ проведен";
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			РезультатСтруктура.Данные.НомерДокумента,
			РезультатСтруктура.Данные.ДатаДокумента 
			);						
			
	Оповещение = Новый ОписаниеОповещения("ОбновитьСписокПТУ", ЭтотОбъект);
	ПоказатьПредупреждение(Оповещение, ТекстСообщения, 4);
	//-Кабанов А.В. 29.08.2025 # UT10-5361
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПТУ(Результат) Экспорт 
	
	ЗагрузитьДокументыПТУ();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокДокументовПТУ");
	ОбщегоНазначения.ОчиститьРегистрСведений("СписокТоваровДокументаПТУ"); 
	ОбщегоНазначения.ОчиститьРегистрСведений("ПараметрыРаботыСДокументомПТУ"); 
	
	СписокПТУ.Параметры.УстановитьЗначениеПараметра("ИспользоватьПоиск", Ложь);
	СписокПТУ.Параметры.УстановитьЗначениеПараметра("НомерДокумента", "");
	
	//Поля = Новый Массив;
	//Поля.Добавить("НомерДокументаОформление");
	//Поля.Добавить("Статус");
	//
	//СписокПТУ.УстановитьОграниченияИспользованияВГруппировке(Поля);
	//СписокПТУ.УстановитьОграниченияИспользованияВОтборе(Поля);
	//СписокПТУ.УстановитьОграниченияИспользованияВПорядке(Поля);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПТУПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	Ключи = Строки.ПолучитьКлючи();
	Для Индекс = 0  По Ключи.Количество()-1 Цикл

		СтрокаСписка = Строки[Ключи[Индекс]];
	
		//СтрокаСписка.Данные["НомерДокументаОформление"] = СтрокаСписка.Данные["НомерДокумента"] + " от " 
		//	+ СТРОКА(Формат(СтрокаСписка.Данные["ДатаДокумента"], "ДФ=dd.MM.yyyy")) + "г.";
			
		Если СтрокаСписка.Данные["Статус"] = "Не начат" Тогда	
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноЗеленый);
			
		ИначеЕсли СтрокаСписка.Данные["Статус"] = "В работе" Тогда						
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ТемноОранжевый);				
			
		ИначеЕсли СтрокаСписка.Данные["Статус"] = "Размещение не завершено" Тогда									
			
			СтрокаСписка.Оформление["Статус"].УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Красный);							
			
		КонецЕсли; 
			
	КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Процедура ЗначениеДляПоискаПриИзмененииНаСервере(ЗначениеДляПоиска)

	СписокПТУ.Параметры.УстановитьЗначениеПараметра("НомерДокумента", "%"+ЗначениеДляПоиска+"%");
	СписокПТУ.Параметры.УстановитьЗначениеПараметра("ИспользоватьПоиск", Истина);

КонецПроцедуры

&НаКлиенте
Процедура Поиск(Команда)
	
	ЗначениеДляПоискаПриИзмененииНаСервере(ЭтаФорма.ЗначениеДляПоиска);
	Оповестить("ОбновлениеДанных");	                                   

КонецПроцедуры

&НаКлиенте
Процедура КнТЕНажатие(Команда)
	
	//+Сёмин Р. 24.12.2025 #UT10-5593
	ФормаТранспортныеЕдиницы = ПолучитьФорму("Обработка.ТранспортныеЕдиницы.Форма.ФормаТранспортныхЕдиниц", Новый Структура("ИсключаемыеСтатусы", "В пути"), ЭтаФорма);
	ФормаТранспортныеЕдиницы.Открыть();
	//-Сёмин Р. 24.12.2025 #UT10-5593
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПТУНаПроверкеВЧЗ(Команда)
	
	Элементы.ПроверкаВЧЗ.Пометка = НЕ Элементы.ПроверкаВЧЗ.Пометка;
	
	УстановитьОформлениеКнопок();

	Если Элементы.ПроверкаВЧЗ.Пометка Тогда
		
		РезультатСтруктура = ОбщегоНазначения.ЗагрузитьСписокДокументовПТУ_ЧЗ();	
		
		Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
			
			ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 3);	
			Возврат;
			
		КонецЕсли; 
		
		Если РезультатСтруктура.Результат Тогда
			
			СписокПТУ.Параметры.УстановитьЗначениеПараметра("ИспользоватьПоиск", Ложь);
			СписокПТУ.Параметры.УстановитьЗначениеПараметра("НомерДокумента", "");
			
			Оповестить("ОбновлениеДанных");
			
		КонецЕсли;         
		
	Иначе 
		
		ПолучитьДокументыПТУ(Неопределено);
		
	КонецЕсли;
		
КонецПроцедуры 

Процедура УстановитьОформлениеКнопок()
		
	Элементы.ПроверкаВЧЗ.ЦветРамки = ?(Элементы.ПроверкаВЧЗ.Пометка,WebЦвета.Желтый, Новый Цвет());
	Элементы.ПроверкаВЧЗ.КнопкаПоУмолчанию = Элементы.ПроверкаВЧЗ.Пометка; 
	
КонецПроцедуры
